{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "happy",
    "1": "sad",
    "2": "lonely",
    "3": "romantic",
    "4": "excited",
    "5": "relaxed",
    "6": "stressed",
    "7": "dark",
    "8": "emotional",
    "9": "mind-bending",
    "10": "curious",
    "11": "nostalgic",
    "12": "motivated",
    "13": "adventurous",
    "14": "wholesome",
    "15": "scared"
  },
  "initializer_range": 0.02,
  "label2id": {
    "adventurous": 13,
    "curious": 10,
    "dark": 7,
    "emotional": 8,
    "excited": 4,
    "happy": 0,
    "lonely": 2,
    "mind-bending": 9,
    "motivated": 12,
    "nostalgic": 11,
    "relaxed": 5,
    "romantic": 3,
    "sad": 1,
    "scared": 15,
    "stressed": 6,
    "wholesome": 14
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "vocab_size": 30522
}
